<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key></key>
	<string></string>
	<key>%@</key>
	<string>%@</string>
	<key>%@ %@ %@</key>
	<string>%1$@ %2$@ %3$@</string>
	<key>AccessDenied</key>
	<string>⚠️ Сповіщення Заборонено ⚠️

Відкрийте будь ласка Налаштування Сповіщень та надайте дозвіл для Xcodes, якщо ви бажаєте отримувати сповіщення.</string>
	<key>AccessGranted</key>
	<string>Сповіщення Дозволено.
Ви будете отримувати сповіщення від Xcodes.</string>
	<key>Acknowledgements</key>
	<string>Подяки</string>
	<key>Active</key>
	<string>Активний</string>
	<key>Active/Select</key>
	<string>Активний / Вибраний</string>
	<key>ActiveVersionDescription</key>
	<string>Це активна версія</string>
	<key>Advanced</key>
	<string>Розширені</string>
	<key>Alert.CancelInstall.Message</key>
	<string>Будь-який прогрес буде втрачено.</string>
	<key>Alert.CancelInstall.PrimaryButton</key>
	<string>Скасувати інсталяцію</string>
	<key>Alert.CancelInstall.Runtimes.Title</key>
	<string>Чи дійсно ви хочете скасувати інсталяцію Xcode %@?</string>
	<key>Alert.CancelInstall.Title</key>
	<string>Чи дійсно ви хочете скасувати інсталяцію Xcode %@?</string>
	<key>Alert.DeletePlatform.PrimaryButton</key>
	<string>Видалити</string>
	<key>Alert.DeletePlatform.Title</key>
	<string>Чи дійсно ви хочете видалити %@?</string>
	<key>Alert.Install.AuthError.Message</key>
	<string>You are not authorized. Please Sign in with your Apple ID first.</string>
	<key>Alert.Install.Error.Need.Xcode16.1</key>
	<string>Apple only supports downloading runtimes iOS 16.0+, watchOS 9.0+, tvOS 16+, visionOS 1.0+ with Xcode 16.1+. Please download, make active and try again.</string>
	<key>Alert.Install.Error.Need.Xcode26</key>
	<string>Apple supports downloading Apple Silicon runtimes only when Xcode 26+ is selected. Please Select and try downloading again or download the universal build.</string>
	<key>Alert.Install.Error.Title</key>
	<string>Не вдалося інсталювати Xcode</string>
	<key>Alert.InstallArchive.Error.Title</key>
	<string>Помилка з архівом Xcode</string>
	<key>Alert.MinSupported.Message</key>
	<string>Xcode %@ вимагає щонайменше macOS %@, але у вас macOS %@, всеодно продовжити?</string>
	<key>Alert.MinSupported.Title</key>
	<string>Мінімальні вимоги не виконані</string>
	<key>Alert.PostInstall.Title</key>
	<string>Не можливо виконати пост-інсталяційні дії</string>
	<key>Alert.PrivilegedHelper.Error.Title</key>
	<string>Не вдалося інсталювати "Privileged Helper"</string>
	<key>Alert.PrivilegedHelper.Message</key>
	<string>Xcodes використовує спеціальний "Privileged Helper" для запуску задач від імені root. Це включає, наприклад, sudo в терміналі, та кроки після інсталяції або перемикання версії Xcode за допомогою xcode-select.

Буде запит на ваш пароль від Mac щоб інсталювати цей помічник.</string>
	<key>Alert.PrivilegedHelper.Title</key>
	<string>Privileged Helper</string>
	<key>Alert.Select.Error.Title</key>
	<string>Не вдалося вибрати Xcode</string>
	<key>Alert.SymLink.Message</key>
	<string>Xcode.app вже існує, і це не символічне посилання</string>
	<key>Alert.SymLink.Title</key>
	<string>Не вдалося створити символічне посилання</string>
	<key>Alert.Uninstall.Error.Message.FileNotFound</key>
	<string>Не вдалося знайти файл "%@".</string>
	<key>Alert.Uninstall.Error.Title</key>
	<string>Не можливо видалити Xcode</string>
	<key>Alert.Uninstall.Message</key>
	<string>Xcode буде просто переміщено до Кошика, без повного видалення.</string>
	<key>Alert.Uninstall.Title</key>
	<string>Видалити Xcode %@?</string>
	<key>Alert.Update.Error.Title</key>
	<string>Не вдалося оновити обраний Xcode</string>
	<key>All</key>
	<string>Всі</string>
	<key>An error occurred</key>
	<string>Сталася помилка</string>
	<key>AppUpdates</key>
	<string>Оновлення Xcodes.app</string>
	<key>Apple Silicon</key>
	<string>Apple Silicon</string>
	<key>AppleID</key>
	<string>Apple ID:</string>
	<key>Architecture</key>
	<string>Архітектура</string>
	<key>Authenticating</key>
	<string>Authenticating</string>
	<key>AutomaticInstallNewVersion</key>
	<string>Автоматично інсталювати нові версії Xcode</string>
	<key>AutomaticallyCreateSymbolicLink</key>
	<string>Автоматично створювати символічне посилання Xcode.app</string>
	<key>AutomaticallyCreateSymbolicLinkDescription</key>
	<string>Створювати символічне посилання Xcode.app що вказує на обрану версію при зміні активного Xcode. 
Символічне посилання буде розміщено у папці інсталяції Xcode</string>
	<key>Beta</key>
	<string>Beta</string>
	<key>BetaOnly</key>
	<string>лише Beta</string>
	<key>Cancel</key>
	<string>Скасувати</string>
	<key>Category</key>
	<string>Категорія</string>
	<key>Change</key>
	<string>Змінити</string>
	<key>CheckForAppUpdates</key>
	<string>Автоматично перевіряти наявність оновлень</string>
	<key>CheckNow</key>
	<string>Перевірити зараз</string>
	<key>CheckingSecurity</key>
	<string>Перевірка безпеки</string>
	<key>Close</key>
	<string>Закрити</string>
	<key>Compatibility</key>
	<string>Сумісність</string>
	<key>Compilers</key>
	<string>Компілятори</string>
	<key>Continue</key>
	<string>Продовжити</string>
	<key>CopyPath</key>
	<string>Скопіювати шлях</string>
	<key>CopyReleaseNoteURL</key>
	<string>Скопіювати URL</string>
	<key>CreateSymLink</key>
	<string>Створити символічне посилання як Xcode.app</string>
	<key>CreateSymLinkBeta</key>
	<string>Створити символічне посилання як Xcode-Beta.app</string>
	<key>DataSource</key>
	<string>Джерело</string>
	<key>DataSourceDescription</key>
	<string>Apple — сканування Apple Developer Portal у пошуку доступних версій Xcode. Надає список усіх нових релізів, але є менш надійним.

[Xcode Releases](https://xcodereleases.com) — це неофіційний список релізів Xcode. Він є більш структурованим та надає додаткову інформацію (що не завжди доступна напряму від Apple), і менш ймовірно зламається якщо Apple оновить Developer Portal.</string>
	<key>DigitCodeDescription</key>
	<string>Введіть %d-значний код з одного з довірених пристроїв:</string>
	<key>Dismiss</key>
	<string>Закрити</string>
	<key>DownloadSize</key>
	<string>Розмір завантаження</string>
	<key>Downloader</key>
	<string>Завантажувач</string>
	<key>DownloaderDescription</key>
	<string>[aria2](https://github.com/aria2/aria2) може використовувати до 16 з'єднань, завантажуючи Xcode у 3-5 разів швидше ніж URLSession. Вона поставляється у вигляді бінарника та коду, відповідно до вимог її GPLv2 ліцензії.

URLSession — це завантажувач за-умовчанням від Apple</string>
	<key>Downloading</key>
	<string>Викачування</string>
	<key>DownloadingError</key>
	<string>Не знайдено інформації для викачування</string>
	<key>DownloadingPercentDescription</key>
	<string>Викачано  : %d%%</string>
	<key>Downloads</key>
	<string>Завантаження</string>
	<key>EnableNotifications</key>
	<string>Увімкнути Сповіщення</string>
	<key>EnterDigitCodeDescription</key>
	<string>Введіть %1$d-значний код відправлений на %2$@:</string>
	<key>Error</key>
	<string>Помилка</string>
	<key>Experiments</key>
	<string>Експерименти</string>
	<key>FasterUnxip</key>
	<string>Швидкий Unxip</string>
	<key>FasterUnxipDescription</key>
	<string>Завдяки [@_saagarjha](https://twitter.com/_saagarjha), цей експеримент може пришвидшити розпаковку майже на 70%. 

Подробиці про unxip тут — https://github.com/saagarjha/unxip</string>
	<key>Filter</key>
	<string>Фільтр</string>
	<key>FilterArchitecturesDescription</key>
	<string>Фільтруйте версії Xcode за архітектурою.</string>
	<key>FilterAvailableDescription</key>
	<string>Фільтрувати доступні версії</string>
	<key>FilterInstalledDescription</key>
	<string>Фільтрувати інстальовані версії</string>
	<key>Finishing</key>
	<string>Завершення</string>
	<key>General</key>
	<string>Загальне</string>
	<key>GithubRepo</key>
	<string>GitHub репозиторій</string>
	<key>GroupXcodeVersionsInList</key>
	<string>Group Xcode versions in the list</string>
	<key>HelperClient.error</key>
	<string>Помилка комунікації з "Privileged Helper".</string>
	<key>HelperInstalled</key>
	<string>Helper інстальовано</string>
	<key>HelperNotInstalled</key>
	<string>Helper не інстальовано</string>
	<key>IdenticalBuilds</key>
	<string>Ідентичні Білди</string>
	<key>IdenticalBuilds.help</key>
	<string>Буває що RC та Release насправді ідентичні (однаковий Build). У такому випадку Xcodes буде показувати обидві версії разом.</string>
	<key>IncludePreRelease</key>
	<string>Також інсталювати RC / Beta версії</string>
	<key>Install</key>
	<string>Інсталювати</string>
	<key>Install Apple Silicon</key>
	<string>Install Apple Silicon</string>
	<key>Install Universal</key>
	<string>Install Universal</string>
	<key>InstallDescription</key>
	<string>Інсталювати цю версію</string>
	<key>InstallDirectory</key>
	<string>Шлях інсталяції</string>
	<key>InstallHelper</key>
	<string>Інсталювати Helper</string>
	<key>InstallPathDescription</key>
	<string>Xcodes шукає інсталяції та встановлює нові версії у вказану директорію. За-умовчанням,до /Applications (рекомендується). 
Будь-які зміни шляху розташування Xcode можуть призвести до втрати дієздатності інших застосунків / сервісів. </string>
	<key>InstallationError.CodesignVerifyFailed</key>
	<string>Викачаний Xcode не зміг пройти перевірку підпису (code signing verification) з наступним повідомленням:
%@</string>
	<key>InstallationError.DamagedXIP</key>
	<string>Архів "%@" пошкоджено, його не можливо розпакувати.</string>
	<key>InstallationError.FailedSecurityAssessment</key>
	<string>Xcode не пройшов перевірку безпеки (security assessment) з наступним повідомленням:
%@

Він залишиться інстальованим в %@, на випадок якщо ви забажаєте його використовувати.</string>
	<key>InstallationError.FailedToMoveXcodeToApplications</key>
	<string>Помилка при переміщенні Xcode до %@.</string>
	<key>InstallationError.InvalidVersion</key>
	<string>%@ не є коректним номером версії.</string>
	<key>InstallationError.MissingSudoerPassword</key>
	<string>Не вистачає паролю. Спробуйте ще раз.</string>
	<key>InstallationError.MissingUsernameOrPassword</key>
	<string>Не вистачає імені користувача чи паролю. Спробуйте ще раз.</string>
	<key>InstallationError.NoNonPrereleaseVersionAvailable</key>
	<string>Немає доступних Release версій.</string>
	<key>InstallationError.NoPrereleaseVersionAvailable</key>
	<string>Немає доступних RC версій.</string>
	<key>InstallationError.NotEnoughFreeSpaceToExpandArchive</key>
	<string>Архів "%@" не можливо розпакувати, так як бракує місця.

Звільніть файлове сховище щоб вистачило місця на розпаковку Архіву, та спробуйте інсталювати Xcode %@ знову.</string>
	<key>InstallationError.PostInstallStepsNotPerformed.Installed</key>
	<string>Установку завершено. Але деякі post-install кроки не виконано автоматично. Ці кроки буде виконано коли ви вперше запустите Xcode %@.</string>
	<key>InstallationError.PostInstallStepsNotPerformed.NotInstalled</key>
	<string>Інсталяцію завершено. Але деякі кроки після інсталяції не було виконано автоматично. Xcodes виконує цю роботу за допомогою "Privileged Helper", який схоже що не інстальовано. Ви можете встановити його за допомогою Налаштування &gt; Додатково.

Ці кроки буде виконано коли ви вперше запустите Xcode %@.</string>
	<key>InstallationError.UnavailableVersion</key>
	<string>Не можу знайти версію %@.</string>
	<key>InstallationError.UnexpectedCodeSigningIdentity</key>
	<string>Викачаний Xcode має неочікуваний підпис (code signing identity).
Має:
%@
%@
Очікується:
%@
%@</string>
	<key>InstallationError.UnsupportedFileFormat</key>
	<string>Xcodes (поки що) не підтримує свою установку у %@ форматі.</string>
	<key>InstallationError.VersionAlreadyInstalled</key>
	<string>%@ вже інстальовано до %@</string>
	<key>InstallationError.VersionNotInstalled</key>
	<string>%@ не інстальовано.</string>
	<key>InstallationStepDescription</key>
	<string>Крок %1$d з %2$d  : %3$@</string>
	<key>Installed Only</key>
	<string>Лише встановлені</string>
	<key>LastChecked</key>
	<string>Перевірено в останнє  : %@</string>
	<key>License</key>
	<string>Ліцензія</string>
	<key>LocalCachePath</key>
	<string>Локальний Кеш</string>
	<key>LocalCachePathDescription</key>
	<string>Xcodes кешує доступні версії Xcode та тимчасові файли викачувань нових версій в цю директорію</string>
	<key>Login</key>
	<string>Apple ID</string>
	<key>LoginDescription</key>
	<string>Показати Apple ID</string>
	<key>MacOSRequirement</key>
	<string>Необхідна macOS %@ чи новіша</string>
	<key>MakeActive</key>
	<string>Зробити активним</string>
	<key>MakeActiveVersionDescription</key>
	<string>Зробити цю версію активною</string>
	<key>Menu.About</key>
	<string>Про Xcodes</string>
	<key>Menu.Acknowledgements</key>
	<string>Подяки</string>
	<key>Menu.CheckForUpdates</key>
	<string>Перевірити Оновлення...</string>
	<key>Menu.GitHubRepo</key>
	<string>Xcodes GitHub репозіторій</string>
	<key>Menu.ReportABug</key>
	<string>Повідомити про помилку</string>
	<key>Menu.RequestNewFeature</key>
	<string>Запит на новий функціонал</string>
	<key>Misc</key>
	<string>Misc</string>
	<key>Moving</key>
	<string>Переміщення до %@</string>
	<key>Never</key>
	<string>Ніколи</string>
	<key>Next</key>
	<string>Далі</string>
	<key>NoTrustedPhones</key>
	<string>Ваш аккаунт не має перевіреного телефонного номеру, що вимагається для двофакторної авторизації.

Дивіться https://support.apple.com/HT204915.</string>
	<key>NoXcodeSelected</key>
	<string>Не обрано Xcode</string>
	<key>Notification.FinishedInstalling</key>
	<string>Інстальовано</string>
	<key>Notification.NewVersionAvailable</key>
	<string>Доступна нова версія</string>
	<key>Notification.NewXcodeVersion.Body</key>
	<string>Доступні нові версії Xcode</string>
	<key>Notification.NewXcodeVersion.Title</key>
	<string>Нові версії Xcode</string>
	<key>NotificationSettings</key>
	<string>Налаштування Сповіщень</string>
	<key>Notifications</key>
	<string>Сповіщення</string>
	<key>OK</key>
	<string>OK</string>
	<key>OnSelectDoNothing</key>
	<string>Зберігати імʼя як Xcode-X.X.X.app</string>
	<key>OnSelectDoNothingDescription</key>
	<string>При виборі, зберігати імʼя як версію, наприклад,
Xcode-13.4.1.app</string>
	<key>OnSelectRenameXcode</key>
	<string>Завжди змінювати імʼя на Xcode.app</string>
	<key>OnSelectRenameXcodeDescription</key>
	<string>При виборі, автоматично перейменовувати активний Xcode на Xcode.app, змінюючи імʼя попереднього Xcode.app на його версію.</string>
	<key>Open</key>
	<string>Запустити</string>
	<key>Open Browser</key>
	<string>Відкрити браузер</string>
	<key>Open In Rosetta</key>
	<string>Запустити через Rosetta</string>
	<key>OpenDescription</key>
	<string>Запустити цю версію</string>
	<key>PIN</key>
	<string>PIN</string>
	<key>PIN not set</key>
	<string>PIN not set</string>
	<key>Password</key>
	<string>Пароль:</string>
	<key>Paste redirected URL</key>
	<string>Вставити переспрямовану URL-адресу</string>
	<key>Perform post-install steps</key>
	<string>Виконати пост-інсталяційні кроки</string>
	<key>Platforms</key>
	<string>Платформи</string>
	<key>PlatformsDescription</key>
	<string>Installed Platforms</string>
	<key>PlatformsList.Title</key>
	<string>Нижче наведений список платформ що доступні на цій машині</string>
	<key>Preferences</key>
	<string>Налаштування</string>
	<key>PreferencesDescription</key>
	<string>Відкрити Налаштування</string>
	<key>PrivilegedHelper</key>
	<string>Privileged Helper</string>
	<key>PrivilegedHelperDescription</key>
	<string>Xcodes використовує спеціальний "Privileged Helper" для запуску задач від імені root. Це включає, наприклад, sudo в терміналі, та кроки після інсталяції або перемикання версії Xcode за допомогою xcode-select.

Буде запит на ваш пароль від Mac щоб інсталювати цей помічник.</string>
	<key>Refresh</key>
	<string>Оновити</string>
	<key>RefreshDescription</key>
	<string>Оновити список Xcode</string>
	<key>Release</key>
	<string>Реліз</string>
	<key>ReleaseDate</key>
	<string>Дата релізу</string>
	<key>ReleaseNotes.help</key>
	<string>Переглянути деталі релізу</string>
	<key>ReleaseOnly</key>
	<string>лише Release</string>
	<key>Required</key>
	<string>Вимагається</string>
	<key>RevealInFinder</key>
	<string>Показати у Finder</string>
	<key>SDKs</key>
	<string>SDK</string>
	<key>SecurityKeyPinDescription</key>
	<string>Insert your physical security key and enter the PIN</string>
	<key>SecurityKeyTouchDescription</key>
	<string>Touch your security key to verify that it’s you</string>
	<key>Select</key>
	<string>Обрати</string>
	<key>SelectTrustedPhone</key>
	<string>Виберіть довірений номер телефону щоб отримати %d-значний код в СМС:</string>
	<key>Selected</key>
	<string>Обрано</string>
	<key>SendSMS</key>
	<string>Надіслати СМС</string>
	<key>ShowOpenInRosetta</key>
	<string>Показувати опцію "Запустити через Rosetta"</string>
	<key>ShowOpenInRosettaDescription</key>
	<string>Опція "Запустити через Rosetta" зʼявиться там де наразі знаходиться функція "Запустити".
Примітка  : Доступно лише для Apple Silicon машин.</string>
	<key>SignIn</key>
	<string>Увійти</string>
	<key>SignInWithApple</key>
	<string>Вхід з вашим Apple ID.</string>
	<key>SignOut</key>
	<string>Логаут</string>
	<key>Signing out...</key>
	<string>Вихід...</string>
	<key>StopInstallation</key>
	<string>Зупинити інсталяцію</string>
	<key>Support.Xcodes</key>
	<string>Підтримати Xcodes</string>
	<key>TerminateAfterLastWindowClosed</key>
	<string>Terminate App after last window is closed</string>
	<key>This Apple ID uses federated authentication via %@.</key>
	<string>Цей Apple ID використовує федеративну автентифікацію через %@.</string>
	<key>TrashingArchive</key>
	<string>Видалення архіву</string>
	<key>Unarchiving</key>
	<string>Розпаковка (Може бути довго)</string>
	<key>Uninstall</key>
	<string>Видалити</string>
	<key>Universal</key>
	<string>Universal</string>
	<key>UnxipExperiment</key>
	<string>Експеримент Unxip</string>
	<key>UpdatedAt</key>
	<string>Оновлено</string>
	<key>Updates</key>
	<string>Оновлення</string>
	<key>UseUnxipExperiment</key>
	<string>Експериментальний метод розпаковки</string>
	<key>VersionWithBuild</key>
	<string>Версія %@ (%@)</string>
	<key>Versions</key>
	<string>Версії</string>
	<key>WWDC.Message</key>
	<string>👨🏻‍💻👩🏼‍💻 Веселого WWDC %@! 👨🏽‍💻🧑🏻‍💻</string>
	<key>Xcode</key>
	<string>Xcode</string>
	<key>Xcodes</key>
	<string>Xcodes</string>
</dict>
</plist>
